{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"X:0": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy_calc/prediction:0": {"name": "accuracy_calc/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "hidden_1/MatMul", "op": "MatMul", "input": ["X", "hidden_1/W"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "hidden_1/add", "op": "Add", "input": ["hidden_1/B", "hidden_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/Relu", "op": "Relu", "input": ["hidden_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/MatMul", "op": "MatMul", "input": ["hidden_1/Relu", "hidden_2/W"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "hidden_2/add", "op": "Add", "input": ["hidden_2/B", "hidden_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/Relu", "op": "Relu", "input": ["hidden_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output/MatMul", "op": "MatMul", "input": ["hidden_2/Relu", "output/W"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "output/add", "op": "Add", "input": ["output/B", "output/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output/Softmax", "op": "Softmax", "input": ["output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["output/Softmax", "accuracy_calc/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "hidden_1/W", "shape": [784, 512], "dtype": "float32"}, {"name": "output/B", "shape": [10], "dtype": "float32"}, {"name": "hidden_1/B", "shape": [512], "dtype": "float32"}, {"name": "hidden_2/W", "shape": [512, 64], "dtype": "float32"}, {"name": "hidden_2/B", "shape": [64], "dtype": "float32"}, {"name": "output/W", "shape": [64, 10], "dtype": "float32"}, {"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}]}]}